import json

words = [
            {
                'word': 'питон',
                'subwords': [
                    'пони', 'тон', 'ион', 'опт', 'пот', 'тип', 'топ', 'пион', 'понт'
                            ]
            }, {
                'word': 'строка',
                'subwords': [
                    'акр', 'акт', 'кот', 'рак', 'орк', 'оса', 'ток', 'тор', 'кора', 'коса', 'сота', 'торс', 'роса', 'скат'
                            ]
            }, {
                'word': 'набор',
                'subwords': [
                    'бар', 'бор', 'раб', 'нора', 'роба', 'барон'
                            ]
            }, {
                'word': 'ручка',
                'subwords': [
                    'круча', 'чурка', 'куча', 'рука', 'акр', 'рак',
                            ]
            }, {
                'word': 'дерево',
                'subwords': [
                    'ведро', 'древо', 'веер', 'вред', 'двор', 'евро', 'вор', 'род', 'ров'
                            ]
            },
        ]

s = json.dumps(words)

with open('words.JSON.', 'a') as a:
    a.write(s)

# https://jsonkeeper.com/b/GCY0